test/directSegment/generateData/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    front
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          100;
        startFace       2700;
    }
    back
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          100;
        startFace       2800;
    }
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       2900;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       3000;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       3100;
    }
    upperWall
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          100;
        startFace       3200;
    }
)

// ************************************************************************* //
